export default [
  {
    text: "百万数据处理导入导出",
    items: [
      {
        text: "01.前端如何实现海量数据的文件导出-问题提出",
        link: "/exportData/01.前端如何实现海量数据的文件导出-问题提出",
      },
      {
        text: "02.前端如何实现海量数据的文件导出-模拟数据生成-1",
        link: "/exportData/02.前端如何实现海量数据的文件导出-模拟数据生成-1",
      },
      {
        text: "03.前端如何实现海量数据的文件导出-模拟数据生成-2",
        link: "/exportData/03.前端如何实现海量数据的文件导出-模拟数据生成-2",
      },
      {
        text: "04.项目中如何实现百万数据的文件导出之导出分类",
        link: "/exportData/04.项目中如何实现百万数据的文件导出之导出分类",
      },
      {
        text: "05.vue项目中如何实现百万数据的文件导出之一次性导出",
        link: "/exportData/05.vue项目中如何实现百万数据的文件导出之一次性导出",
      },
      {
        text: "06.vue项目中如何实现百万数据的文件导出之分批导出",
        link: "/exportData/06.vue项目中如何实现百万数据的文件导出之分批导出",
      },
      {
        text: "07.vue项目中如何实现百万数据的文件导出之异步请求分批导出",
        link: "/exportData/07.vue项目中如何实现百万数据的文件导出之异步请求分批导出",
      },
      {
        text: "08.vue项目中如何实现百万数据的文件导出之多并发异步请求分批导出",
        link: "/exportData/08.vue项目中如何实现百万数据的文件导出之多并发异步请求分批导出",
      },
      {
        text: "09.vue项目中如何实现百万数据的文件导出之多并发异步请求压缩文件导出",
        link: "/exportData/09.vue项目中如何实现百万数据的文件导出之多并发异步请求压缩文件导出",
      },
    ],
  },
];
